# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [4]:
# Your code here
cur.execute("""SELECT lastName, firstName, city, state FROM employees JOIN offices USING(officeCode) ORDER BY firstName, lastName;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
lastName     23 non-null object
firstName    23 non-null object
city         23 non-null object
state        23 non-null object
dtypes: object(4)
memory usage: 864.0+ bytes
None

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [6]:
# Your code here
cur.execute("""SELECT contactLastName, contactFirstName, orderNumber, orderDate, status FROM customers JOIN orders USING(customerNumber);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  contactLastName contactFirstName  orderNumber   orderDate   status
0         Schmitt          Carine         10123  2003-05-20  Shipped
1         Schmitt          Carine         10298  2004-09-27  Shipped
2         Schmitt          Carine         10345  2004-11-25  Shipped
3            King             Jean        10124  2003-05-21  Shipped
4            King             Jean        10278  2004-08-06  Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [7]:
# Your code here
cur.execute("""SELECT contactLastName, contactFirstName, paymentDate, amount FROM customers JOIN payments USING(customerNumber);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  contactLastName contactFirstName paymentDate    amount
0         Schmitt          Carine   2003-06-05  14571.44
1         Schmitt          Carine   2004-10-19   6066.78
2         Schmitt          Carine   2004-12-18   1676.14
3            King             Jean  2003-06-06  32641.98
4            King             Jean  2004-08-20  33347.88

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [8]:
# Your code here
cur.execute("""SELECT contactLastName, contactFirstName, productName, quantityOrdered, orderDate 
               FROM customers 
               JOIN orders USING(customerNumber)
               JOIN orderdetails USING(orderNumber)
               JOIN products USING(productCode)
               ORDER BY orderDate DESC
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

,contactLastName,contactFirstName,productName,quantityOrdered,orderDate
0,Labrune,Janine,1962 LanciaA Delta 16V,38,2005-05-31
1,Labrune,Janine,1957 Chevy Pickup,33,2005-05-31
2,Labrune,Janine,1998 Chrysler Plymouth Prowler,28,2005-05-31
3,Labrune,Janine,1964 Mercedes Tour Bus,38,2005-05-31
4,Labrune,Janine,1926 Ford Fire Engine,19,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!